# IFCFileReadOptions Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IFCFileReadOptions Properties
IFCFileReadOptions Class See Also
---
The IFCFileReadOptions type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FileName | The full file name of the IFC file to be read. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| XMLConfigFileName | The XML configuration file name. It is used only for reading IFC-XML format file. |

# See Also
IFCFileReadOptions Class
Autodesk.Revit.DB.IFC Namespace